Tekla.Structures.Drawing.RectangularCloud
The RectangularCloud class defines a rectangular cloud that is a rectangle with a specific size set for the bulges.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
RectangularCloud MyRectangularCloud;
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
MyRectangularCloud = new RectangularCloud(views.Current as ViewBase, new Point(10,10), new Point(150,150));
MyRectangularCloud.Insert();
}
}
}
}

Tekla.Structures.Drawing.RectangularCloud.StartPoint
The start point of the rectangular cloud.
Changing this will move the rectangular cloud.

Tekla.Structures.Drawing.RectangularCloud.EndPoint
The end point of the rectangular cloud.

Tekla.Structures.Drawing.RectangularCloud.Width
The width of the rectangular cloud.
Changing the width changes the end point with the width.

Tekla.Structures.Drawing.RectangularCloud.Height
The height of the rectangular cloud.
Changing the height changes the end point with the height.

Tekla.Structures.Drawing.RectangularCloud.Angle
The angle of the rectangular cloud. The rectangular cloud rotates around its start point.

Tekla.Structures.Drawing.RectangularCloud.Attributes
The attributes for the rectangular cloud.

Tekla.Structures.Drawing.RectangularCloud.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.RectangularCloud.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.RectangularCloud.RectangularCloudAttributes)
Creates a new rectangle cloud instance with two points using the given attributes.
Please note that creating a rectangular cloud using two points will re-calculate
the start point to correspond with positive widths and heights.
view: The view.
startPoint: The start point.
endPoint: The end point.
attributes: The rectangualr cloud attributes.

Tekla.Structures.Drawing.RectangularCloud.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new rectangle cloud instance with two points using standard attributes.
Please note that creating a rectangular cloud using two points will re-calculate
the start point to correspond with positive widths and heights.
view: The view.
startPoint: The start point.
endPoint: The end point.

Tekla.Structures.Drawing.RectangularCloud.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,Tekla.Structures.Drawing.RectangularCloud.RectangularCloudAttributes)
Creates a new rectangular cloud instance with the start point and the defined width and height using the given attributes.
view: The view.
startPoint: The start point.
width: The width.
height: The height.
attributes: The rectangular cloud attributes.

Tekla.Structures.Drawing.RectangularCloud.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Double,System.Double)
Creates a new RectangularCloud instance with the start point and the defined width and height using standard attributes.
view: The view.
startPoint: The start point.
width: The width.
height: The height.

Tekla.Structures.Drawing.RectangularCloud.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.RectangularCloud.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.RectangularCloud.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.RectangularCloud.Select
Calls the system to select and retrieve the object.
Returns: True on success.